{"meta":{"title":"DogeFly","subtitle":"","description":"不会飞的doge","author":"不会飞的Doge","url":"https://dogefly.github.io","root":"/"},"posts":[{"tags":[],"title":"【读书笔记】《雪国》","date":"2021/03/08","text":"","permalink":"https://dogefly.github.io/2021/03/08/19/","photos":[]},{"tags":[],"title":"【影评】影武者","date":"2021/03/06","text":"","permalink":"https://dogefly.github.io/2021/03/06/20/","photos":[]},{"tags":[],"title":"【影评】坂上之云","date":"2021/03/06","text":"","permalink":"https://dogefly.github.io/2021/03/06/20/","photos":[]},{"tags":[],"title":"【摄影笔记】注意力分配","date":"2021/03/06","text":"","permalink":"https://dogefly.github.io/2021/03/06/20/","photos":[]},{"tags":[],"title":"【摄影后期入门】储备知识篇","date":"2021/03/04","text":"【摄影后期入门}储备知识篇写在前面： &emsp;&emsp;上期镜头篇里兄弟们呼声最高的就是后期了，说实话博主我的水平真的有限，后期的知识又非常杂，要涉及到色彩理论、绘画相关的知识，毕竟绘画摄影不分家嘛。这些东西在各位通读本篇时，很可能由于我讲的内容不够透彻乃至出现致命错误，导致文意不太好理解或者矛盾，我这里非常非常建议大家善用百度谷歌Wiki等搜索引擎。而且大伙想必也知道科普文章的难处：要严谨就没了幽默，要幽默就很难严谨。楼主自认水平达不到芳斯塔夫和鬼谷老师的水准，做不到讲相声的同时把知识完整、严谨地传递出去，所以本篇读起来呢还是有那么一点枯燥。我希望我的文章可以作为各位学习的教科书索引，列位可以参照我的文章去寻找相关资料。提醒：后期的知识也只是基础，学会后期也只相当于大家学种田刚学会挥两下锄头，具体到什么时候用什么锄法，锄多深就是门艺术了。 &emsp;&emsp;先拿拍照这个动作本身来说，新手第一步学会开着自动挡找合适的焦点和按下快门，就算入门，了不起咱再学习一下曝光三要素。总之多按几下快门，也能筛出来几张比较满意的照片。而后期不同，在胶片时代，一个优秀的摄影师可能不光是一个审美超群的艺术家，还很有可能拥有不俗的化学水平：各种药水的配比、蒙版、遮罩，显影时间都掐着秒计算，非常麻烦，门槛非常高，如果失败还很有可能毁了底片，一般人玩不起也不敢玩。到了数码时代，电脑逐渐普及，后期的门槛大大降低，我们在后期操作时已经不再是对着“底片”进行更改，而是类似于在编辑时对你的编辑操作生成一个描述文本，附带在底片上，这就使得后期的风险和成本大大降低，可玩性大大增加——理论上你能在一张照片上尝试无限种可能。可是，后期的门槛降低指的是物质和金钱上的，知识上的门槛并没有降低，虽然我们不必学习复杂的物理层面的蒙版、遮罩、各种药水的配比，不必忐忑的的等待结果，但是色彩科学作为彩色照片后期的重要核心，它的知识也是非常复杂的。本文旨在介绍后期的基本知识，且由于黑白摄影十分少见，我们重点介绍色彩科学，为上手实操做知识储备。 &emsp;&emsp;在开始之前，我先讲大家初学摄影后期时的常见疑惑： 1.什么是摄影后期？ &emsp;&emsp;就楼主而言，我更主张按下快门为界，把按下快门之前做的所有工作，比如调整灯光、构图、景深、快门速度等等操作定义为前期；按下快门后的，对图片进行如曝光度、畸变、白平衡等进行干预的操作称为后期。 2. 后期有什么用/有什么意义？ &emsp;&emsp;大家平时也都用手机拍照，恐怕都遇到过图片歪斜、过亮或者过暗啊，旁边有人抢镜啊，想拍的天空过曝了啊之类的问题。后期的初衷就是矫正前期的失误，或者是意外。理想状态下摄影师应当在前期就做好全部工作，可现实不是那样，比如各类摄影灯、反光伞、柔光罩都很贵，对于楼主这种穷得叮当响，浑身上下掏不出几个铜子儿的人来说这些东西相当于天方夜谭，根本买不起，除了对着购物车流哈喇子就是流哈喇子，可咱又想要那种灯光效果，只能依靠后期了。再进阶一点的后期用法就是重新构图，调整图片基调，突出主体这种，总之后期是一个人为了把控照片质量而做出的努力，它是摄影这个活动的一部分。 3.存在未经后期的照片吗？ &emsp;&emsp;这个问题的答案很简单：这个世界上不存在严格地未经后期的照片。 &emsp;&emsp;即使是在后期的门槛非常高，调整色彩的难度非常大的胶片时代，为了让普通用户也能舒舒服服地拍出漂亮照，胶片厂商会对面向不同客户的胶片的色彩进行单独的调教，比如柯达会依据不同地区的人群对肤色的偏好调整该地区所销售胶卷的色彩倾向。再举个现在还在靠胶片吃香喝辣的老胶片厂富士，它靠着一手胶片模拟，深得姑娘们喜爱。在民用摄影几乎全部数码化的今天，无后期就更难实现了，比如在读取CMOS感光元件时会进行布尔运算来获得像素矩阵，在读取信号时模拟信号会被FDA转化为电压然后放大一次或多次，再经过ADC转化为数字信号。在此期间信号还会经历一次或多次的降噪处理，这还不算完，各家在色彩调教时的倾向就决定了，即便是完全一致的数字信号也会被转化成不同的图像。4.我只是喜欢拍照，觉得没必要或者懒得学后期，我真的有必要去琢磨这些吗？ &emsp;&emsp;这个就要具体问题具体分析了，如果你只是记录生活，也没啥进阶的欲望，平时发发朋友圈，完全可以不后期的，只是需要在前期花费更多的精力；如果对照片的质量有比较高的要求，或者是难以容忍照片瑕疵的完美主义者，学后期是完全有必要的，这个东西不要求一下子全会，慢慢摸索，几个月之后就有个轮廓了。 好了，上面啰啰嗦嗦了一大堆，现在我们终于可以开始讲解后期的基本知识了：&emsp;&emsp;##1.1认识色彩色彩或者颜色是人眼、大脑及生活经验中对光的属性的感知，它是一种以人类视角来审视世界的一种感性认知。我们感知颜色有两种途径： ① 可见光的波长，波长越短在人眼中越偏蓝、紫色，反之则偏向橙、红色。 ② 通过原色的叠加来获得不同的颜色。 &emsp;&emsp;原色：是指不可由其它颜色混合而得到的颜色。强调一下，这个概念是对人而言的，它不是物理概念，它的产生是由于人的眼睛内有几种辨别颜色的视锥细胞，分别对黄绿色（564nm）、绿色(534nm)和蓝紫色(420nm)的光最敏感。在实际运用中，我们常见的有加法三原色和减法三原色两种原色模型。加法三原色：即光学三原色，它们是红、绿、蓝（靛蓝）三色等量混合为白色（灰色）。 &emsp;&emsp;减法三原色:即颜料三原色，它们是品红、黄、青（天蓝）。颜料三原色的产生是由于颜料或染料是吸收白光中其它波长的光而反射某一些波长的光，这是为颜料调色而产生的色彩模型。 ##2.如何量化的描述色彩？对人类来说色彩是感性的认知，但是对计算机来说就很麻烦，如何让一张图片在不同载体上体现","permalink":"https://dogefly.github.io/2021/03/04/20/","photos":[]},{"tags":[{"name":"博客","slug":"博客","permalink":"https://dogefly.github.io/tags/%E5%8D%9A%E5%AE%A2/"},{"name":"第一次","slug":"第一次","permalink":"https://dogefly.github.io/tags/%E7%AC%AC%E4%B8%80%E6%AC%A1/"}],"title":"Hello My Blog","date":"2021/02/11","text":"我的第一篇博客&emsp;&emsp;互联网发展至今，写博客已经从当初的极度流行到如今的近乎在普通人眼里销声匿迹，成为程序员等极客群体的小众爱好，以我的水平，不管是摄影也好，写作和编程也罢，无论如何都谈不上极客二字的，但我也有很大的动力去搞一个博客写写东西，这里面玩儿的成分自然还是比较大：我更多的把这个博客看作一个树洞、一个笔记本，平时发些学习经验、影评、书评等等，可以说是想到什么写什么了。 动机&emsp;&emsp;搭建一个博客对我这个程序盲来说难度非常大，即便没写几行代码，整体结构也一窍不通，光是用前人搭好的板房来搭屋子也耗费了我大量时间，回头看感觉自己犯的全是弱智错误。哪天有机会把搭博客的教程也写出来吧，希望让更多和我一样的小白也能拥有自己的博客。 思考、记录与分享 “人是一根会思考的苇草” &emsp;&emsp;人类既渺小又高贵，人类血肉苦弱，比之浩瀚宇宙，渺如微尘的寿命与脑容量让人类越来越难负担所积攒的巨大知识储备，而人类从未停止思考的脚步，尽管大多数人的绝大多数思考结果都只会“让上帝发笑”，但我们一直在尝试通过羸弱的大脑与思想丈量整个世界。 无数渺小的思考填满了人的一生 &emsp;&emsp;可能是在翻山越岭后见到的震撼风景；可能《雪国》里映在玻璃窗中的叶子；可能是马孔多刮起最后的飓风将我手中《百年孤独》合上书页时；可能是第一次在晴朗的月夜架起长焦镜头将对焦环拧到合焦的那一瞬；可能是第一次知晓世界上竟有双缝干涉这种受观察者影响改变结果的实验时。 &emsp;&emsp;我常常因为这些经历和思考而感到惊喜，与人分享之余，我有种将这些东西记录下来的冲动，而博客就是我心中的完美载体。 这件事真的挺酷： &emsp;&emsp;很小的时候我就幻想可以拥有一个属于自己的网站，对我来说这真的是一件非常非常酷的事情，想象互联网世界的如高楼耸立，如大海般深邃难测，又如黑森林一般幽萦，我能在这个世界里拥有一个专属自己的一叶扁舟供以驰骋，一间在漆黑一片的森林里亮着暖黄色灯光的小木屋作大本营，实在让人感觉到有些幸福。","permalink":"https://dogefly.github.io/2021/02/11/21/","photos":["https://images.weserv.nl/?url=https://i0.hdslb.com/bfs/article/af4e23096ddb79c6662ccb15606ed76b4eaccf50.png"]},{"tags":[],"title":"test","date":"2021/02/11","text":"TEST","permalink":"https://dogefly.github.io/2021/02/11/14/","photos":[]}],"categories":[],"tags":[{"name":"博客","slug":"博客","permalink":"https://dogefly.github.io/tags/%E5%8D%9A%E5%AE%A2/"},{"name":"第一次","slug":"第一次","permalink":"https://dogefly.github.io/tags/%E7%AC%AC%E4%B8%80%E6%AC%A1/"}]}